import React, { useEffect, useState } from "react";
import Graph from "./Graph/graph";
import "./info.css";

const Info = props => {
  return (
    <section className="info">
      <h1>Coronavirus (COVID-19)</h1>
      <hr />
      <Graph />

      <p>
        <br />
        <h4>מהו נגיף (וירוס) קורונה?</h4> נגיפי קורונה הינם משפחה גדולה של
        נגיפים (וירוסים) הידועים כגורמים למחלות בבעלי חיים ועלולים לגרום לתחלואה
        גם בבני אדם. הם קיבלו את שמם עקב הדמיון שלהם במיקרוסקופ אלקטרוני לכתר
        (קורונה בלטינית). חומרת הפגיעה של הנגיף בבני אדם משתנה בין הנגיפים
        השונים במשפחה ונעה ממחלה קלה כגון הצטננות, למחלות עם הסתמנות קלינית קשה,
        הפוגעות בריאות וגורמות לאי ספיקה רב מערכתית כגון, התסמונת הנשימתית המזרח
        התיכונית (MERS) והתסמונת הנשימתית החמורה (SARS).
      </p>
      <p>
        <h4>מהו נגיף קורונה novel corona virus 2019?</h4>
        נגיף קורונה החדש לא זוהה בעבר כגורם למחלה בבני אדם. במהלך דצמבר 2019 הוא
        החל הנגיף לגרום לצבר תחלואה בדלקת ריאות בעיר ווהאן אשר במחוז חוביי במרכז
        סין, ולאחר מכן תוארה התפשטות של התחלואה לכל המחוזות בסין וכן למקומות
        אחרים בעולם. מבין כל נגיפי קורונה אשר גורמים למחלה בבני אדם, נגיף ה-SARS
        אשר גרם למחלה קשה בשנים 2003/4, הוא הדומה ביותר לנגיף קורונה החדש מבחינת
        הרכבו הגנטי. ב-11.2.2020 ארגון הבריאות העולמי העניק שם רשמי לנגיף:
        SARS-CoV-2, ולמחלה שהוא גורם: COVID-19. ב-11.3.2020 הכריז ארגון הבריאות
        העולמי על התפרצות הקורונה כפנדמיה (מגפה).
      </p>
      <p>
        <h4>כיצד בני אדם נדבקים בנגיף?</h4>
        נגיף קורונה החדש לא זוהה בעבר כגורם למחלה בבני אדם. במהלך דצמבר 2019
        הואהרוב המכריע של החולים הראשונים באירוע עבדו או ביקרו בשוק בעלי חיים
        ופירות ים בווהאן. מכאן עלתה הסברה כי הנגיף עבר מבעלי חיים לאדם, אך עד כה
        לא זוהה בוודאות איזה בעל חיים. כעת קיימת העברה של הנגיף מאדם לאדם. הנגיף
        מופרש מדרכי הנשימה של אדם חולה בעיקר בעת עיטוש או שיעול והטיפות הניתזות
        יכולות להישאף על ידי אנשים אחרים או לנחות על משטחים. אנשים אשר זמן קצר
        לאחר מכן יגעו במשטחים אלה ובהמשך יגעו בפה, באף או בעיניים של עצמם עלולים
        להידבק. כל מגע גופני בין בני אדם ללא חציצה כמו נשיקה, חיבוק, יחסי מין
        ואף לחיצת יד, עלול להיות מדבק. טרם הוברר עד כמה המחלה מדבקת, אך בשלב זה
        נראה כי רמת ההדבקה דומה לפחות לזו של נגיף השפעת. הדבקה מחולים אשר
        התסמינים שלהם קלים ביותר אפשרית.
      </p>
      <p>
        <h4>מהם תסמיני המחלה? ועד כמה היא חמורה?</h4>
        חלק משמעותי מן הנדבקים בנגיף הקורונה אינם מפתחים תסמינים כלל. בקרב
        החולים סימני המחלה דומים לאלו של שפעת. למעשה, לא ניתן לרוב להבדיל ללא
        בדיקה ייעודית בין הדבקה בנגיף קורונה לבין מחלות נשימתיות רבות אחרות.
        התסמינים השכיחים ביותר של המחלה הם חום, עייפות ושיעול יבש. אחד מכל שישה
        חולים יפתח מחלה קשה שתתבטא בקשיי נשימה. מבוגרים, חולים במחלות כרוניות
        דוגמת מחלת לב או סכרת ואנשים הסובלים מפגיעה במערכת החיסון נוטים יותר
        לפתח מחלה קשה. במקרים החמורים ביותר המחלה עלולה להוביל לדלקת ריאות קשה,
        לתסמונת נשימתית חמורה, לאי ספיקת כליות ואף למוות. שיעור התמותה מהמחלה
        מוערך בכ-2% מהחולים, אך יש שונות גדולה מאד בנתונים המגיעים ממדינות
        שונות. חשוב לציין כי מאחר ורבים מהנדבקים אינם מפתחים תסמינים ניתן להניח
        כי שיעור התמותה מבין הנדבקים הוא נמוך יותר.
      </p>

      <iframe
        width="700"
        height="415"
        src="https://www.youtube.com/embed/Ex-7qYdBXYI"
        frameborder="0"
        allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture"
        allowfullscreen
      ></iframe>
    </section>
  );
};

export default Info;
